{
  "Book_10": {
    "Grammatical Structures": "1. How + to-infinitive after find out, forget, know, learn, remember, show, teach, tell, ask:\n   Example - 'Sam knows how to swim.'\n2. Adverbial clauses of time with after, before, until, when, and while.\n3. BE + supposed to.\n4. Predicate adjective + to-infinitive:\n   Examples - afraid, glad, happy, pleased, ready, sorry, upset.\n   Example - 'We're ready to go.'\n5. Verb + gerund as direct object:\n   Examples - begin, enjoy, finish, like, mind, start.\n   Example - 'She enjoys singing.'\n6. Prepositions of location:\n   Examples - above, across (from), at, behind, below, by, in, in back/front of, near, next (to), on, under.\n7. Simple present for future tense.\n8. Polite requests with could, would, can, will and responses with can, will, and can't.\n9. Report/Inquire about commands and requests with say and ask:\n   Example - 'What did the officer say?' → 'He said to stop.'\n10. BE + able to.\n11. Impersonal 'it' as subject to refer to temperature, weather, time, and distance.\n12. How far to ask about distance and time required to travel:\n   Example - 'How far is it to NY? It's 60 miles. It takes 1 hour.'",
    "Vocabulary Lists": "button, candy bar, chewing gum, chip, coin return, cream, detergent, diet drink, drink, dryer, knob, lever, machine, nut, opening, selection, soda, soda pop, soft drink, time, tray, vending machine, washing machine,\nadult, cafeteria, clothing store, department store, discount store, elevator, escalator, floor, introduction, mall, neighbor, neighborhood, parking lot, rule, shop, shopping center, stairs, supermarket, supper, variety,\nair, cover, hub cap, jack, key, lug, nut, tire, trunk, wheel, wrench,\narticle, aunt, baby, boss, business, businessman, businesswoman, cashier, collection, company, cousin, dentist, driver, folks, grandfather, grandmother, grandparent, magazine, marriage, nephew, niece, newspaper, news, occupation, parent, relative, salesman, salesperson, saleswoman, secretary, uncle, work, writer,\nbe supposed to, was supposed to, drop, dropped, dispense, find out, found out, get back, got back, insert, lift, operate, stick, stuck, teach, taught, work, decide, introduce, let, mind, receive, shake, shook, shop, write down, wrote down,\ncan, could, cover, hand out, hurry, inflate, jack up, keep, kept, loosen, lower, mind, pass out, raise, remove, replace, tighten, will, would, be able to, was able to, collect, marry, own, take, took, type, work on,\nafter, another, before, everywhere, exact, exactly, favorite, finally, for, last, lastly, no, out of, out of order, popular, stuck, until, when, while,\nafraid, alone, down, downstairs, everybody, everyone, go shopping, polite, politely, up, upstairs, certainly, common, enough, flat, in a hurry, loose, of course, quick, quickly, spare, the back, the front, tight, about, famous, far, from, get married, how, it, married, pleasant, single, extra."
  },
  "Book_11": {
    "Grammatical Structures": "1. Present Perfect with BE/HAVE in statements and yes/no questions only:\n   Example - 'I've had a car for 5 years.' and 'Have you been sick?'\n2. How long in questions about duration.\n3. Present Perfect Progressive:\n   Example - 'What have you been doing?' and 'I've been waiting since 1:00.'\n4. Indefinite pronouns: anyone, anybody, someone, somebody, no one, nobody.\n5. Linking verbs become/get + subject complement to show change in condition:\n   Example - 'I get nervous before a test.' and 'Did he become a doctor?'\n6. Adjective clauses with that, which, and who.\n7. Too + adjective + (for/to) to express excessiveness for a particular purpose:\n   Example - 'The tea is too hot for me to drink.'\n8. Verb + infinitive of purpose:\n   Example - 'I stopped to buy some shoes.'\n9. Noun + suffix -y to form adjectives meaning full of, characterized by, or like.\n10. Could for past ability.\n11. Reported speech with told:\n   Example - 'Did you tell Jane that you had her book?' and 'Yes, I told her that I had it.'\n12. Prepositions of time: after, at, before, for, from, in, on, since, till, to, until.",
    "Vocabulary Lists": "ache, appointment, back, backache, checkup, chest, cold, cough, dot, earache, emergency, examination, fever, headache, inch, inches, middle,\nnurse, pain, patient, physical, problem, sneezing, stomach, stomachache, symptom, temperature, caution, crossing, instructor, intersection, lane,\npedestrian, railroad crossing, right-of-way, sidewalk, sign, signal, speed, speed limit, steering wheel, stop sign, turn, way, brake, charge, credit,\nengine, grease, guarantee, hose, leak, motor, noise, oil, part, refund, satisfaction, service, tune-up, cards, channel, commercial, dish, entertainment,\nlove, plan, program, variety, ache, catch, caught, come in, came in, connect, cough, get there, got there, make it, made it, run, ran, run a temperature,\nran a temperature, see, saw, sneeze, become, became, confuse, fail, flash, follow, get, got, mean, meant, pass, pull over, signal, slow down, speed,\nyield, charge, credit, exchange, give back, gave back, grease, guarantee, leak, oil, refund, satisfy, stall, tune up, warm, dissatisfied, could, entertain,\nfeel, felt, frighten, intend, laugh, love, plan, recommend, serve, spend, spent, sped, annual, any longer, anymore, horizontal, how about ...?, in,\nparallel, perpendicular, regular, runny, since, sometime, still, then, vertical, ahead, ahead of, anybody, cautious, cautiously, in advance, lost,\nmiles an hour, miles per hour, nervous, no one, nobody, one-way, relaxed, somebody, that, two-way, which, who, greasy, leaky, noisy, oily, on sale,\nsatisfied, too, unhappy, as a matter of fact, boring, busy, dull, entertaining, frequently, frightening, funny, if you ask me, great, impolite, impolitely,\nin fact, loud, loudly, prompt, promptly, reasonable, reasonably, rudely, sharp, since, terrible, terribly, out, rude, wonderful."
  },
  "Book_12": {
    "Grammatical Structures": "1. If + present/future/modal:\n   Example - 'If she asks me, I'll go.'\n   Example - 'Should I go if she asks?'\n2. Present Perfect to connect past with present:\n   Example - 'I've studied English for five years.'\n   Example - 'I've studied English since I was a child.'\n3. Time expressions: already, no longer, yet, anymore, any longer, still.\n4. Present Perfect for indefinite past:\n   Example - 'I've been to Italy.'\n   Example - 'Have you ever cooked?'\n5. Coordinating conjunctions so & or:\n   Example - 'It rained, so we left.'\n   Example - 'Did he go, or did he stay?'\n6. Could for possibility and conjecture.\n7. Emotive adjectives from verbs with -ed and -ing:\n   Examples - excite, interest, bore, confuse, tire, frighten.\n8. Reported speech with say:\n   Example - 'What did you say?'\n   Example - 'I said (that) Jane was here.'\n9. Used to for past routines and conditions.\n10. Would for past routines.\n11. Comparative adverbs with -er (than):\n   Examples - earlier, farther, faster, harder, higher, later, lower, nearer, slower, sooner, straighter.",
    "Vocabulary Lists": "calm, clear, dangerous, deep, freezing, frightened, humid, like, none, quiet, slippery, unpleasant, confused, confusing, medical, professional, technical, during, ever, except, no longer, occasionally,\nbeach, breeze, climate, heat, humidity, sea, thought, wind,\nassociate degree, bachelor's degree, career, choice, college, course, decision, degree, diploma, discussion, education, educator, elementary school, field, future, grade, high school, master's degree, middle school, offer, Ph.D., profession, professional, refusal, tour, tour of duty, university,\naddition, builder, cassette, cd, den, dining room, fire, fireplace, get-together, idea, meeting, oven, patio, plan, player, room, shed, solution, speaker, stereo, story, suburb, trouble, wood,\ncountry, deer, duck, fish, fishing rod, gun, instructions, line, outdoors, own, pistol, plenty, rifle, shot, walk, weapon,\nbe over, was over, been over, belong, blow, blew, blown, clear up, could use, expect, last, remain, slip, stay, accept, change one's mind, discuss, educate, make up one's mind, made up one's mind, refuse, retire, take, took, taken, talk over, think over, thought over,\nadd on, boil, build, built, burn, could, enlarge, get together, got together, gotten together, heat, leave, play, solve, take place, took place, taken place,\ncatch, caught, fish, go, went, gone, hunt, kill, practice, prepare, shoot, shot, used to, would, offer, left,\nif, already, instead, instead of, just, so, yet, interested, near, perhaps, then, tiring, all over, farther, further, hard, high, in the open, indoors, low, more, once, outdoors, out-of-doors, own, several, slow, twice, whole."
  },
  "Book_13": {
    "Grammatical Structures": "1. Replace that-clause with so or not:\n   Example - 'Will it rain? I believe so.'\n   Example - 'I hope not.'\n2. Express certainty with certain, positive, sure followed by a that-clause.\n3. Short superlative adverbs:\n   Examples - early, far, fast, hard, high, late, low, near, slow, soon, straight.\n4. Permission with could; response with can & can't.\n5. Review modals for 50% possibility, permission, & ability (present & past).\n6. Noun adjuncts / compound nouns:\n   Examples - shoe shop, bookstore.\n7. Separable phrasal verbs:\n   Example - 'I'll wake you up at 6 a.m.'\n8. Reported speech with said & told and the modals may, might, can, could, be able to.\n9. Verb + -er/-or to form nouns meaning one who & one which:\n   Example - 'He visits often. He's my favorite visitor.'\n10. How + adjective in questions about linear measurement, age, weight, temperature.\n11. Simple present if clause + present (general truths).\n12. Simple present if clause + imperative.\n13. Indefinite pronouns:\n   Examples - a few, a little, a lot, any, many, much, none, some.",
    "Vocabulary Lists": "certain, farthest, furthest, positive, quite, uncertain, away, fond, man-made, natural, past, free, irregular, less, medium, much, special, weigh, fat, thick, thin, certainly, surely,\ncoach, doubt, field, goal, jump, knot, match, meaning, meter, player, point, practice, race, reporter, rope, score, shoelaces, stadium, string, tie,\nashtray, bracelet, chain, copper, cotton, diamond, earrings, glass, gold, iron, jewelry, leather, leave, material, metal, necklace, nylon, plastic, polyester, ring, rock, rubber, silk, silver, stone, wool,\namount, bargain, cloth, deal, discount, distance, dressing room, fabric, hip, inch, item, pair, percent, receipt, sale, size, tax, waste,\nage, centimeter, depth, diet, distance, foot, feet, height, inch, kilometer, length, meter, mile, millimeter, scale, strength, weight, width, yard,\ndiet, gain, measure, beat, beaten, believe, coach, doubt, imagine, join, jump, kick, lose, lost, match, race, score, suppose, tie, throw, threw, thrown, win, won,\nallow, appreciate, be made of, could, do over, did over, done over, owe, pay back, paid back, put out, throw away, threw away, thrown away, throw out, threw out, thrown out, wake up, woke up, woken up,\namount to, bargain, decrease, discount, fit, increase, reduce, sew, sewed, sewn, try on,\nmost, so, towards, off, on a diet, a few, a little, a lot, many, much, for sure, for sale, on sale, percent, sales, by."
  },
  "Book_14": {
    "Grammatical Structures": "1. Regular & irregular plural count nouns.\n2. Just for recent past & soon for immediate future:\n   Example - 'I have just finished.' and 'I will soon go home.'\n3. As + adjective or adverb + as to express (in)equality:\n   Example - 'Matt isn't as tall as Bob.'\n4. Future progressive tense:\n   Example - 'We will be leaving soon.'\n5. Adverbs of degree: extremely, quite, rather, really, so, terribly, very.\n6. Clauses with when & where.\n7. If-clauses for present or future probability.\n8. If-clauses for indefinite past probability.\n9. Gerund used as subject or object of preposition:\n   Example - 'Swimming is fun.'\n10. Must & must not for deduction or probability:\n   Example - 'Sam isn't here. He must be sick.'\n11. Modal review for necessity, lack of necessity, prohibition, future action or condition, general requests.\n12. Ought to for giving advice.\n13. Reported speech with said or told and modals: will, be going to, must, have to, not have to, must not.\n14. Comparative adverbs: better than, worse than & superlative adverbs: the best, the worst.",
    "Vocabulary Lists": "advanced, basic, enlisted, retired, in bloom, thick, all, broke, comfortable, poor, pretty, proud, rich, scared, soft, uncomfortable,\naccidental, foreign, lucky, rough, smooth, a little, a lot, around, much, rather, when, where, better, best, worse, worst, extremely, probably, poorly, proudly, softly, accidentally, smoothly,\narmed forces, assignment, bar, chance, duty, follow-on training, grade, insignia, marine corps, opportunity, personnel, promotion, recruit, retirement, service, station, training,\nbarn, blossom, bridge, cabin, calf, calves, cattle, cow, crop, destruction, dirt, farm, farmer, forest, harvest, horse, location, picnic, plant, ranch, rancher, reflection, sheep, silo, valley, wheat,\nbirth, birthday, candle, certificate, couple, gift, luck, present, song, surprise, turn, volume, computer, e-mail, fare, group, internet, passenger, promise, refreshment, report, seat, smell, taste, tour, tourist, website, beside,\nassign, be assigned, be promoted, be stationed, be up for, enlist, promote, serve, station, train, be born, bloom, blossom, destroy, graze, harvest, light, lit, locate, make, made, plant, raise, reflect, take care of, took care of, taken care of,\nafford, be born, believe, blow out, blew out, blown out, come over, came over, continue, drop by, drop in, go over, went over, gone over, look forward to, must, sing, sang, sung, take turns, took turns, taken turns, turn down, turn up, wrap,\nattempt, board, cancel, e-mail, ought to, promise, put aside, report, smell, take a chance, taste, tour, because of, besides, besides, underneath, abroad, as soon as, by, online, a green thumb, from now on, by accident, by chance, just as, on, on and on."
  },
  "Book_15": {
    "Grammatical Structures": "1. Adverbs of frequency:\n   Example - 'I am always on time.'\n2. Questions with how often; Answers with adverbs of frequency.\n3. Comparative form more or less + adverb & Superlative form most or least + adverb.\n4. Adding -ion to verbs to make nouns.\n5. Willingness with will & would.\n6. Modal review for advice; past repeated action, condition, or situation; obligation; deduction; desire; & possibility.\n7. Indefinite place or location with somewhere, anywhere, & nowhere.\n8. Was/were going to for unfulfilled past intention:\n   Example - 'I was going to watch TV, but I fell asleep.'\n9. Indefinite compounds with else:\n   Example - 'Let's go somewhere else.'\n10. Reflexive pronouns:\n   Example - 'Did George hurt himself?'\n11. Emphatic pronouns:\n   Example - 'I painted the picture myself.'\n12. Adjective complement after linking verbs:\n   Example - 'The coffee tastes strong.'\n13. Suffix -ly for adverbs and adjectives:\n   Example - 'daily, weekly, nightly, etc.'",
    "Vocabulary Lists": "physical, tough, afraid, fresh, glad, stale, alive, dead, unusual, usual, allergic, dizzy, ill, pulled, sprained, still, swollen,\narea, basic training, battle dress uniform, briefing, broom, cadet, dorm, drill, drill instructor, drill sergeant, firing range, guard, instruction, iron, mop, physical training, polish, sweat, trainee, training instructor,\nanniversary, bag, barbecue, beer, celebration, ceremony, cheese, chocolate, club, company, guest, honeymoon, invitation, ketchup, luncheon, mayonnaise, mustard, pickles, potato salad, rain check, reception, roll, sauce, steak, strawberry, tradition, wedding, wine, a while,\nAfrica, Antarctica, application, Asia, Australia, continent, death, document, Europe, history, holiday, life, lives, museum, North America, orders, photograph, reason, ride, South America, visa, allergy, aspirin, bed rest, blood, blood pressure, care, clinic, drug, flu, injury, laboratory, medication, mirror, muscle, operation, penicillin, pharmacy, pill, prescription, pulse, record, shot, sick call, social security number, tablet, treatment,\nby oneself, herself, himself, itself, myself, ourselves, themselves, yourself, yourselves,\nattend, crawl, drill, enter, fall in, fall out, guard, instruct, iron, join, march, mop, polish, scrub, sweat, sweep, swept, yell,\nbarbecue, celebrate, have got, have over, had over, hold, held, invite, miss, slice, will, would,\napply, die, earn, leave, left, notice, order, postpone, require, was going to, were going to,\nappear, bleed, bled, calm, examine, get a prescription filled, injure, lie down, lay down, lain down, operate, prescribe, quiet, seem, sign out, sign in, treat, wipe,\nat attention, everything, afterward, anywhere, as, before, inside, nowhere, outside, somewhere, around, in addition to, overseas, unusually,\nthis is killing me, help yourself, by air, take a photograph, daily."
  },
  "Book_16": {
    "Grammatical Structures": "1. It + BE + adjective/noun phrase:\n   Example - 'It's not a good idea to jog at night.'\n2. Why don't / Why not to give advice/suggestions.\n3. Had better for strong advice.\n4. Past perfect.\n5. Present BE-passive to express present habits.\n6. Have got to to express obligation or necessity.\n7. Past perfect progressive.\n8. Prefer + noun/pronoun/gerund + to/rather than + noun/pronoun/gerund:\n   Example - 'I prefer tea to coffee.' and 'I prefer walking to driving.'\n9. Prefer + to-infinitive + rather than + bare infinitive:\n   Example - 'I prefer to swim rather than run.'\n10. Would rather (than):\n   Example - 'I'd rather ski than swim.'\n11. Adjective/adverb + enough:\n   Example - 'He's old enough to join.'\n12. Be unable to to express incapability.\n13. Too much / too many + (non)count noun:\n   Example - 'There are too many cars.'\n14. Verb to noun with -tion and -sion.",
    "Vocabulary Lists": "active, closed, convenient, doubtful, fit, gradual, impossible, necessary, open, possible, proper, compulsory, honorable, junior, loyal, senior, subordinate,\nantique, classical, close, enough, humorous, kind, modern, musical, scary, serious, capable, incapable, intelligent, smart, gradually, possibly, properly, regularly, unnecessary, furthermore,\nactivity, energy, equipment, fitness, health, lap, nap, relaxation, sleep, suggestion, swimming pool, weights,\nauthority, behavior, belief, chain of command, commissioned officer, courtesy, custom, honor, installation, loyalty, privilege, regulation, respect, responsibility, right, salute, seniority, sense, subordinate,\nactor, actress, adventure, award, ballet, comedy, concert, drama, drums, guitar, humor, instrument, musical, musician, opera, orchestra, performance, piano, play, preference, role, row, stage, symphony, talent, theater, type, violin,\nability, air conditioner, component, copy, data, experience, hard drive, hardware, installation, keyboard, monitor, mouse, printer, program, screen, software, typewriter,\nagainst, it, avoid, check out, cut down, cut out, had better, jog, look after, nap, skip, take part in, took part in, taken part in, take up, took up, taken up, try out,\nbehave, have got to, honor, observe, render, respect, take advantage of, act, award, can't stand, dislike, hate, perform, play, prefer, quit, would rather,\nadjust, assemble, be unable to, burn, copy, enter, figure out, handle, install, lend a hand, load, organize, print, put together, replace, shut down, shut off, take apart, took apart, taken apart,\neven, either, likewise, neither, rather than, little by little, for example."
  },
  "Book_18": {
    "Grammatical Structures": "1. \"It\" + \"be\" + adjective + (that): Example - \"It is possible that we will have a test tomorrow.\"\n2. Correlative conjunctions: Example - \"Justin is studying both Russian and English.\"\n3. Reported questions: Examples - \"Bob asked if he could go\" and \"Jan asked why they left.\"\n4. Present Unreal Conditional: Example - \"If I had money, I would buy a ticket to the game.\"\n5. Wish: Example - \"I wish I had money to buy a ticket.\"\n6. \"Be\" + used to: Example - \"Mike is used to waking up early for classes.\"\n7. Negative Questions: Examples - \"Don't you want to go?\" and \"Why didn't Mike go?\"\n8. Logical Impossibility: Example - \"The car can't be out of gas.\"\n9. Suffix \"-ness\" for adjectives.\n10. Suffix \"-ment\" for verbs.\n11. Perfect Modals: Example - \"We should have gone to the movies.\"\n12. Restrictive Adjective Clauses: Example - \"The car that we bought was blue.\"\n13. Verb + adjective + to-infinitive: Example - \"John advised me to speak with the boss.",
    "Vocabulary Lists": "academic, current, eligible, ineligible, motivated, political, primary, qualified, social, favorable, foggy,\ninvisible, probable, severe, unfavorable, visible, agreement, chief, concerned, definite, excellent, indefinite, main,\npersonal, unemployed, along, blind, deaf, disabled, sudden, hazardous, severely, unlikely, chiefly, personally, academy,\nanthropology, appointee, appointment, biology, campaign, candidate, chemistry, design, economics, engineer, engineering,\ngraduate, leader, leadership, physics, president, program, qualification, science, scientist, semester, social science,\nsociology, strategy, barricade, coast, condition, damage, danger, drizzle, evacuation, fact, flash, flood, force, fog,\nforecast, hail, hazard, hurricane, lightening, sleet, thunder, tornado, visibility, warning, weatherman, benefit, chief,\nconcern, disagreement, employee, employer, employment, head, point, policy, supervisor, unemployment, childhood,\nconsideration, control, detail, disability, force, memory, share, acquire, appoint, design, elect, establish, lead,\nled, motivate, name, reach, vote, barricade, be accustomed to, be used to, drizzle, evacuate, flash, flood, rose, forecast,\nhail, look out, rise, risen, run into, ran into, set up, sleet, strike, struck, take precaution, warn, watch out, wish,\nadvise, agree, benefit, can't be, convince, couldn't be, disagree, employ, fire, get off, got off, gotten off, get rid of,\ngot rid of, gotten rid of, hire, permit, point out, supervise, blame, blind, bring back, brought back, carry, communicate,\ncontrol, could have, force, look after, ought to have, persuade, remind, set aside, should have, spoil, qualify, as, now,\nhowever, such as, therefore, both … and, neither … nor, not only … but also, likely."
  },
  "Book_19": {
    "Grammatical Structures": "1. Adding \"-'s\" and \"-'\" to show possession; possessive adjectives and pronouns; inseparable phrasal verbs: Example - \"Bob ran into an old friend.\"\n2. Perfect modals: may/might/could have (past possibility), must have (deduction), couldn't have (past impossibility); adjective causative with \"have/make/get\"; indefinite adjectives and pronouns: few, little.\n3. \"If\" clauses + perfect modals for past hypothetical situations: Example - \"If I had known, I would have helped you\"; passive causative with \"have/get\"; nouns and verbs to adjectives with \"-able\" and \"-ible.\"\n4. \"Wish\" + past perfect: Example - \"I wish I had gone with you\"; review of \"too\" and \"very\"; review of reported present tenses.",
    "Vocabulary Lists": "culture, divorce, female, file, grandchild, grandchildren, granddaughter, grandson, in-law, knowledge, link, male, relationship, sex, spouse, tolerance, attract, click (on), divorce, end up, get along (in), get along (with), inquire about, neglect (to), put up with, tolerate, all at once, along with, alongside (of), certain, complete, consequently, eager, ex-, general, general, great-, in addition, incomplete, once in a while, someday, specific, tolerant, while, assistance, bite, bite, chemical, department, fuel, helmet, method, rest, arrange, arrange, assist, bite, could have, coudn't have, drop off, drop off, drown, get s.o. to do s.th., get through to, get through with, have s.o. do s.th, insist (on), insist (on), inspect, keep away (from), make s.o. do s.th., may have, might have, misplace, must have, prevent, rescue, respond, run across, search, stay away (from), use up, absolutely, according to, according to, at least, at least, convinced, convincing, entire, fatal, few, in place of, little, otherwise, preventable, trim, attendance, capability, confidence, guidance, mission, mission, routine, self-confidence, skill, success, technique, accomplish, account for, achieve, adjust (to), assume responsibility, congratulate, develop, guide, make sense, object (to), obtain, succeed, confident, educational, once, quite a few, quite a(n) + adj + n, routine, sensible, successful, sufficient, attention, lack (of), regret, rush, volunteer, annoy, disappoint, drop out of, hand in, lack, regret, rush, start out (on), stay up, take off, take off, turn in, volunteer, waste, annoyed, annoying, as well as, disappointed, disappointing, guilty, helpful, helpless, learn a lesson, lenient, lose one's temper, strict, stupid."
  },
  "Book_20": {
    "Grammatical Structures": "1. Review: Indefinite adjective quantifiers:\n   Example - 'We have little time.'\n2. Review: how many / much.\n3. Review: Unit noun + of + (non)count noun:\n   Example - 'a jar of pickles.'\n4. Review: Quantifier + of:\n   Example - 'some of, none of, etc.'\n5. Passive voice with present/past progressive.\n6. Adverbs: where else, when else, how else, why else.\n7. Pronouns: who else, whom else, what else.\n8. Volition verb + direct object (+ to be) + past participle:\n   Example - 'I want him (to be) fired.'\n9. Verb + to be (direct object):\n   Example - 'I want to be hired.'\n10. Reported speech: past to past perfect.\n11. Nouns/verbs to adjectives with -ive / -tive.\n12. Comparative/superlative adjective/pronoun quantifiers.\n13. So (that) + adverb clause of purpose.\n14. Equality/inequality with as many / much (+ noun) + as.\n15. Review: Adverbs of degree:\n   Example - 'little, less, the least, much, more, the most.'",
    "Vocabulary Lists": "bet, cost, groceries, ingredient, jar, label, list, mixture, purchase, quantity, recipe, set, vitamin,\nbake, become of, bet, call for, combine, create, depend on, fry, give away, grill, list, mix, purchase, put off, separate, stir, tear up,\na good deal of, a great deal of, altogether, apart, apart from, baked, can't help, feel like, fried, from time to time, most, mostly, on hand, raw, separate, thus,\nally, attack, battle, border, combat, defense, enemy, freedom, member, peace, property, security, situation, threat, war,\nalert, attack, authorize, call up, defend, define, engage, maintain, notify, settle, take over, threaten,\nadditional, alert, neutral, nevertheless, on alert, secure, take control of, take sides, take steps,\nclutch, coil, combustion, cylinder, distributor, exhaust, filter, fuel injector, function, gear, ignition, line, pedal, piston, pressure, process, pump, purpose, spark, spark plug, system, transmission, valve,\naccelerate, eliminate, filter, ignite, provide, pump, release, shift, supply, transmit,\nautomatic, internal, manual, standard, antifreeze, coolant, defect, estimate, exterior, fluid, friction, interior, liquid, lubrication, maintenance, malfunction, odometer, overhaul, pipe, surface, thermostat,\nalign, circulate, estimate, look over, lubricate, malfunction, overheat, rebuild, regulate, rub, service, wear out,\ndefective, for the purpose of, have a look at, in order to, so (that), step on the gas, take a look at, used, useful, wear and tear, worn out."
  }
}
